/* Boucle DO avec BY */
MAIN: PROCEDURE OPTIONS(MAIN) ;
 DECLARE I FIXED BINARY ;
 DECLARE S FIXED BINARY INITIAL(0) ;
 S = 0 ;
 DO I = 2 TO 10 BY 2 ;
  S = S + I ;
 END ;
 PUT LIST (S) ;
 PUT SKIP ;
END MAIN ;
