/* Built-ins MAX et MIN */
MAIN: PROCEDURE OPTIONS(MAIN) ;
 DECLARE A FIXED BINARY ;
 DECLARE B FIXED BINARY ;
 A = MAX(4, 9) ;
 B = MIN(4, 9) ;
 PUT LIST (A) ;
 PUT SKIP ;
 PUT LIST (B) ;
 PUT SKIP ;
END MAIN ;
