/* SELECT avec OTHERWISE */
MAIN: PROCEDURE OPTIONS(MAIN) ;
 DECLARE K FIXED BINARY ;
 K = 5 ;
 SELECT (K) ;
  WHEN (1) PUT LIST (10) ;
  WHEN (2) PUT LIST (20) ;
  OTHERWISE PUT LIST (99) ;
 END ;
 PUT SKIP ;
END MAIN ;
