/* Appel de procedure avec RETURN */
ABSVAL: PROCEDURE (X) RETURNS (FIXED BINARY) ;
 RETURN (ABS(X)) ;
END ABSVAL ;

MAIN: PROCEDURE OPTIONS(MAIN) ;
 DECLARE R FIXED BINARY ;
 R = ABSVAL(-8) ;
 PUT LIST (R) ;
 PUT SKIP ;
END MAIN ;
