/* Fonction constante */
FIVE: PROCEDURE RETURNS (FIXED BINARY) ;
 RETURN (5) ;
END FIVE ;

MAIN: PROCEDURE OPTIONS(MAIN) ;
 DECLARE R FIXED BINARY ;
 R = FIVE() ;
 PUT LIST (R) ;
 PUT SKIP ;
END MAIN ;
