/* Parentheses dans les expressions */
MAIN: PROCEDURE OPTIONS(MAIN) ;
 DECLARE R FIXED BINARY ;
 R = (2 + 5) * 3 ;
 PUT LIST (R) ;
 PUT SKIP ;
END MAIN ;
