/* Somme d'un tableau */
MAIN: PROCEDURE OPTIONS(MAIN) ;
 DECLARE T (3) FIXED BINARY STATIC ;
 DECLARE I FIXED BINARY ;
 DECLARE S FIXED BINARY INITIAL(0) ;
 T(1) = 1 ;
 T(2) = 2 ;
 T(3) = 3 ;
 S = 0 ;
 DO I = 1 TO 3 ;
  S = S + T(I) ;
 END ;
 PUT LIST (S) ;
 PUT SKIP ;
END MAIN ;
