/* Test TODO 18 - Fonctions integrees partie 2 */

/* Fonctions de mots */
s = "Hello World Foo Bar"
SAY WORDS(s)
SAY WORD(s, 2)
SAY WORDINDEX(s, 2)
SAY WORDLENGTH(s, 2)
SAY SUBWORD(s, 2, 2)
SAY DELWORD(s, 2, 1)

/* Fonctions arithmetiques */
SAY ABS(-42)
SAY SIGN(-7)
SAY SIGN(0)
SAY SIGN(5)
SAY MAX(10, 20)
SAY MIN(10, 20)
SAY TRUNC(42)

/* Fonctions de conversion */
SAY C2D("A")
SAY D2C(65)
SAY D2X(255)

/* Fonctions diverses */
SAY DATE()
SAY TIME()
